app/Controllers/Clientes.php

SELECT *
FROM `clientes`
WHERE `clientes`.`id` = '32'
SELECT COUNT(*) AS `numrows`
FROM `pedidos`
WHERE `cliente_id` = '32'
SELECT SUM(`valor`) AS `total_gasto`
FROM `pedidos`
WHERE `cliente_id` = '32'
 LIMIT 1
---
    public function painel($id)
    {
        $clienteModel = new ClienteModel();
        $pedidoModel  = new PedidosModel();

        // Carrega o cliente
        $cliente = $clienteModel->find($id);
        if (! $cliente) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound("Cliente #{$id} não encontrado");
        }

        // Estatísticas básicas
        $totalPedidos   = $pedidoModel->where('cliente_id', $id)->countAllResults();
        $somaTotal = $pedidoModel
            ->selectSum('valor', 'total_gasto')
            ->where('cliente_id', $id)
            ->first()->total_gasto ?? 0;