app/Controllers/Clientes.php

SELECT *
FROM `clientes`
ORDER BY `nome` ASC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `clientes`
---
    public function index()
    {
        $buscar = $this->request->getGet('q');
        $model  = new \App\Models\ClienteModel();

        if ($buscar) {
            $model->like('nome', $buscar);
        }

        $clientes = $model
            ->orderBy('nome', 'asc')
            ->paginate(10, 'grupoClientes');

DELETE FROM `clientes`
WHERE `id` IN ('32')
---
    public function excluir($id)
    {
        $model = new ClienteModel();
        $model->delete($id);

SELECT *
FROM `pedidos`
WHERE `cliente_id` = '32'
ORDER BY `data_compra` DESC
 LIMIT 1
---
    public function historico($id)
    {
        $clienteModel = new ClienteModel();
        $pedidoModel = new \App\Models\PedidosModel();

        $cliente = $clienteModel->find($id);
        $filtros = $this->request->getGet();

        $builder = $pedidoModel->where('cliente_id', $id);

        if (!empty($filtros['data_inicio'])) {
            $builder->where('data_compra >=', $filtros['data_inicio']);
        }

        if (!empty($filtros['data_fim'])) {
            $builder->where('data_compra <=', $filtros['data_fim']);
        }

        if (!empty($filtros['valor_min'])) {
            $builder->where('valor >=', $filtros['valor_min']);
        }

        if (!empty($filtros['valor_max'])) {
            $builder->where('valor <=', $filtros['valor_max']);
        }

        $pedidos = $builder
            ->orderBy('data_compra', 'ASC') // mantém ordenação antiga
            ->findAll();

SELECT *
FROM `clientes`
WHERE `clientes`.`id` = '34'
SELECT COUNT(*) AS `numrows`
FROM `pedidos`
WHERE `cliente_id` = '34'
SELECT SUM(`valor`) AS `total_gasto`
FROM `pedidos`
WHERE `cliente_id` = '34'
 LIMIT 1
SELECT *
FROM `pedidos`
WHERE `cliente_id` = '34'
ORDER BY `data_compra` DESC
 LIMIT 1
---
    public function painel($id)
    {
        $clienteModel = new ClienteModel();
        $pedidoModel  = new PedidosModel();

        $cliente = $clienteModel->find($id);
        if (! $cliente) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound("Cliente #{$id} não encontrado");
        }

        // Estatísticas
        $totalPedidos = $pedidoModel->where('cliente_id', $id)->countAllResults();
        $somaTotal = $pedidoModel
            ->selectSum('valor', 'total_gasto')
            ->where('cliente_id', $id)
            ->first()->total_gasto ?? 0;
        $valorMedio = $totalPedidos ? round($somaTotal / $totalPedidos, 2) : 0;
        $ultimaCompra = $pedidoModel
            ->where('cliente_id', $id)
            ->orderBy('data_compra', 'DESC')
            ->first()->data_compra ?? null;