app/Controllers/Clientes.php

SELECT *
FROM `clientes`
---
    public function index()
    {
        $model = new ClienteModel();
        $dados['clientes'] = $model->findAll();