app/Controllers/Dashboard.php

SELECT COUNT(*) AS `numrows` FROM `clientes`
SELECT COUNT(*) AS `numrows`
FROM `clientes`
WHERE `recorrente` = 1
SELECT *
FROM `clientes`
SELECT SUM(`total_gasto`) AS `total_gasto`
FROM `clientes`
 LIMIT 1
SELECT `cidade`, COUNT(*) as total
FROM `clientes`
GROUP BY `cidade`
ORDER BY `total` DESC
 LIMIT 1
---
    public function index()
    {
        $model = new ClientesModel();

        $totalClientes = $model->countAll();
        $clientesRecorrentes = $model->where('recorrente', 1)->countAllResults();
        $totalGasto = $model->selectSum('total_gasto')->first()['total_gasto'] ?? 0;
        $ticketMedio = $totalClientes > 0 ? $totalGasto / $totalClientes : 0;

        $cidadeTop = $model
            ->select('cidade, COUNT(*) as total')
            ->groupBy('cidade')
            ->orderBy('total', 'DESC')
            ->limit(1)
            ->first()['cidade'] ?? 'Nenhuma';