app/Controllers/Pedidos.php

    public function adicionar()
    {
        $clienteNome = $this->request->getGet('cliente');
        $cliente = null;

        $clienteModel = new ClienteModel();
        $clientes = $clienteModel->findAll();

        if ($clienteNome) {
            $cliente = $clienteModel->where('nome', $clienteNome)->first();
---
SELECT *
FROM `clientes`
WHERE `nome` = 'Deyvson Felipe'
 LIMIT 1