app/Controllers/Pedidos.php

SELECT *
FROM `clientes`
SELECT *
FROM `clientes`
WHERE `clientes`.`id` = '34'
---
    public function adicionar()
{
    $clienteId = $this->request->getGet('cliente_id');
    $cliente = null;

    $clienteModel = new \App\Models\ClienteModel();
    $clientes = $clienteModel->findAll();

    if ($clienteId) {
        $cliente = $clienteModel->find($clienteId);

INSERT INTO `pedidos` (`cliente_id`, `valor`, `data_compra`, `descricao`) VALUES (32, 576, '2025-06-02', '')
UPDATE `clientes` SET `data_ultima_compra` = '2025-06-02 00:00:00', `total_gasto` = 576, `updated_at` = '2025-06-10 04:05:30'
WHERE `clientes`.`id` IN ('32')
---
    public function salvar()
{
    $clienteNome = $this->request->getPost('cliente');
    $clienteModel = new ClienteModel();
    $cliente = $clienteModel->where('nome', $clienteNome)->first();

    if (!$cliente) {
        return redirect()->to('/clientes/criar')->with('error', 'Não encontramos esse cliente. Você pode cadastrá-lo antes de continuar.');
    }

    $valor = (float) $this->request->getPost('valor');
    $data = $this->request->getPost('data');
    $descricao = $this->request->getPost('descricao');

    $erros = [];
    if ($valor <= 0) {
        $erros[] = 'Informe um valor maior que zero para o pedido.';
    }
    if (empty($data)) {
        $erros[] = 'A data da compra é obrigatória.';
    }
    if (empty($clienteNome)) {
        $erros[] = 'O nome do cliente precisa ser informado.';
    }

    if (!empty($erros)) {
        return redirect()->back()->withInput()->with('errors', $erros);
    }

    $pedidoModel = new PedidosModel();
    $pedidoModel->insert([
        'cliente_id' => $cliente['id'],
        'valor' => $valor,
        'data_compra' => $data, // agora salva corretamente como 'Y-m-d'
        'descricao' => $descricao,
    ]);

    $cliente['total_gasto'] += $valor;
    $cliente['data_ultima_compra'] = $data;
    $clienteModel->save($cliente);

SELECT *
FROM `pedidos`
WHERE `pedidos`.`id` = '26'
SELECT *
FROM `clientes`
WHERE `clientes`.`id` = 32
SELECT *
FROM `clientes`
---
    public function editar($id)
    {
        $pedidoModel = new PedidosModel();
        $pedido = $pedidoModel->find($id);

        if (!$pedido) {
            return redirect()->back()->with('error', 'Não foi possível localizar este pedido.');
        }

        $clienteModel = new ClientesModel();
        $cliente = $clienteModel->find($pedido['cliente_id']);
        $clientes = $clienteModel->findAll();

SELECT *
FROM `pedidos`
WHERE `pedidos`.`id` = '26'
UPDATE `pedidos` SET `valor` = 555, `data_compra` = '2025-06-02 00:00:00', `descricao` = ''
WHERE `pedidos`.`id` IN ('26')
SELECT *
FROM `clientes`
WHERE `clientes`.`id` = 32
UPDATE `clientes` SET `data_ultima_compra` = '2025-06-02 00:00:00', `total_gasto` = 555, `updated_at` = '2025-06-12 02:24:29'
WHERE `clientes`.`id` IN ('32')
---
    public function atualizar($id)
    {
        $pedidoModel = new PedidosModel();
        $pedido = $pedidoModel->find($id);

        if (!$pedido) {
            return redirect()->back()->with('error', 'Este pedido não está disponível ou já foi removido.');
        }

        $valorAntigo = $pedido['valor'];
        $clienteId = $pedido['cliente_id'];

        $valorNovo = (float) $this->request->getPost('valor');
        $data = $this->request->getPost('data');
        $descricao = $this->request->getPost('descricao');

        $erros = [];
        if ($valorNovo <= 0) {
            $erros[] = 'O valor do pedido deve ser maior que zero.';
        }
        if (empty($data)) {
            $erros[] = 'A data do pedido é obrigatória.';
        }

        if (!empty($erros)) {
            return redirect()->back()->withInput()->with('errors', $erros);
        }

        $pedidoModel->update($id, [
            'valor' => $valorNovo,
            'data_compra' => Time::createFromFormat('Y-m-d H:i:s', $data . ' 00:00:00'),
            'descricao' => $descricao,
        ]);

        $clienteModel = new ClientesModel();
        $cliente = $clienteModel->find($clienteId);

        $cliente['total_gasto'] = ($cliente['total_gasto'] - $valorAntigo) + $valorNovo;
        $cliente['data_ultima_compra'] = $data;
        $clienteModel->save($cliente);

SELECT *
FROM `pedidos`
WHERE `pedidos`.`id` = '25'
SELECT *
FROM `clientes`
WHERE `clientes`.`id` = 31
UPDATE `clientes` SET `total_gasto` = 103, `updated_at` = '2025-06-12 02:03:51'
WHERE `clientes`.`id` IN ('31')
DELETE FROM `pedidos`
WHERE `id` IN ('25')
---
    public function excluir($id)
    {
        $pedidoModel = new PedidosModel();
        $pedido = $pedidoModel->find($id);

        if (!$pedido) {
            return redirect()->back()->with('error', 'Não encontramos esse pedido para excluir.');
        }

        $clienteModel = new ClientesModel();
        $cliente = $clienteModel->find($pedido['cliente_id']);

        $cliente['total_gasto'] -= $pedido['valor'];
        $clienteModel->save($cliente);

        $pedidoModel->delete($id);